<a href="https://colab.research.google.com/github/Chong618/Encoded-Auditor/blob/main/Import_FS_from_webpage.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [4]:
url = 'https://www.sec.gov/Archives/edgar/data/1652044/000165204419000004/goog10-kq42018.htm'

In [5]:
df = pd.read_html(url)

In [6]:
len(df)

382

In [10]:
df[238].head(10)

                                                   0  ...                       7
0                                                NaN  ...                     NaN
1                                                NaN  ...                     NaN
2                                                NaN  ...  As ofDecember 31, 2018
3                                             Assets  ...                     NaN
4                                    Current assets:  ...                     NaN
5                          Cash and cash equivalents  ...                     NaN
6                              Marketable securities  ...                     NaN
7  Total cash, cash equivalents, and marketable s...  ...                     NaN
8  Accounts receivable, net of allowance of $674 ...  ...                     NaN
9                       Income taxes receivable, net  ...                     NaN

[10 rows x 8 columns]

In [11]:
balsht = df[238][[0,2,6]]

In [12]:
balsht.head(10)

                                                   0  ...                       6
0                                                NaN  ...                     NaN
1                                                NaN  ...                     NaN
2                                                NaN  ...  As ofDecember 31, 2018
3                                             Assets  ...                     NaN
4                                    Current assets:  ...                     NaN
5                          Cash and cash equivalents  ...                   16701
6                              Marketable securities  ...                   92439
7  Total cash, cash equivalents, and marketable s...  ...                  109140
8  Accounts receivable, net of allowance of $674 ...  ...                   20838
9                       Income taxes receivable, net  ...                     355

[10 rows x 3 columns]

In [13]:
balsht.columns = ['Account', '31 Dec 2017', '31 Dec 2018']

In [14]:
balsht.head()

           Account              31 Dec 2017             31 Dec 2018
0              NaN                      NaN                     NaN
1              NaN                      NaN                     NaN
2              NaN  As of December 31, 2017  As ofDecember 31, 2018
3           Assets                      NaN                     NaN
4  Current assets:                      NaN                     NaN

In [15]:
balsht = balsht.dropna()
balsht.head()

                                             Account 31 Dec 2017 31 Dec 2018
5                          Cash and cash equivalents       10715       16701
6                              Marketable securities       91156       92439
7  Total cash, cash equivalents, and marketable s...      101871      109140
8  Accounts receivable, net of allowance of $674 ...       18336       20838
9                       Income taxes receivable, net         369         355

In [16]:
balsht = balsht.reset_index(drop=True)

In [17]:
balsht.head()

                                             Account 31 Dec 2017 31 Dec 2018
0                          Cash and cash equivalents       10715       16701
1                              Marketable securities       91156       92439
2  Total cash, cash equivalents, and marketable s...      101871      109140
3  Accounts receivable, net of allowance of $674 ...       18336       20838
4                       Income taxes receivable, net         369         355

In [19]:
balsht.tail()

                                              Account 31 Dec 2017 31 Dec 2018
29  Class A and Class B common stock, and Class C ...       40247       45049
30               Accumulated other comprehensive loss        (992      (2,306
31                                  Retained earnings      113247      134885
32                         Total stockholders’ equity      152502      177628
33         Total liabilities and stockholders’ equity      197295      232792

In [24]:
#Check data types
balsht[['31 Dec 2017', '31 Dec 2018']].dtypes

31 Dec 2017    object
31 Dec 2018    object
dtype: object

In [29]:
#Replace the open paranthesis '(' with negative sign '-'
#Map function https://pandas.pydata.org/pandas-docs/version/0.19.2/generated/pandas.Series.map.html
#Lambda function https://www.analyticsvidhya.com/blog/2020/03/what-are-lambda-functions-in-python/
balsht['31 Dec 2017'] = balsht['31 Dec 2017'].map(lambda x: x.replace('(', '-').replace(',', ''))
balsht['31 Dec 2018'] = balsht['31 Dec 2018'].map(lambda x: x.replace('(', '-').replace(',', ''))

In [31]:
balsht.tail()

                                              Account 31 Dec 2017 31 Dec 2018
29  Class A and Class B common stock, and Class C ...       40247       45049
30               Accumulated other comprehensive loss        -992       -2306
31                                  Retained earnings      113247      134885
32                         Total stockholders’ equity      152502      177628
33         Total liabilities and stockholders’ equity      197295      232792

In [32]:
#Since the datatype is now object, lets convert it to number (float)
balsht[['31 Dec 2017', '31 Dec 2018']] = balsht[['31 Dec 2017', '31 Dec 2018']].astype(float)

In [34]:
balsht.head()

                                             Account  31 Dec 2017  31 Dec 2018
0                          Cash and cash equivalents      10715.0      16701.0
1                              Marketable securities      91156.0      92439.0
2  Total cash, cash equivalents, and marketable s...     101871.0     109140.0
3  Accounts receivable, net of allowance of $674 ...      18336.0      20838.0
4                       Income taxes receivable, net        369.0        355.0

In [35]:
#sum the total
balsht['31 Dec 2017'].iloc[[0,1]].sum()

101871.0

In [37]:
#define total_cash
total_cash_2017 = balsht['31 Dec 2017'].iloc[[0,1]].sum()

In [38]:
#validation/ casting check
total_cash_2017 == balsht.iloc[2]['31 Dec 2017']

True